nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
        <register>
          <name>STARTERSET0</name>
          <description>Set bits in STARTER</description>
          <addressOffset>0x6A0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xF97FFFFF</resetMask>
          <fields>
            <field>
              <name>SYS_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDMA0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_GLOBALINT0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_GLOBALINT1_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT00_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT01_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT02_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT03_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UTICK0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MRT0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER1_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SCT0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER3_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT1_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT2_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT3_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT4_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT5_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT6_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT7_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC0_THCMP_OVR_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB0_NEEDCLK_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTC_LITE0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WAKEUP_MAILBOX0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER0 register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTERSET1</name>
          <description>Set bits in STARTER</description>
          <addressOffset>0x6A4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x8FFF847F</resetMask>
          <fields>
            <field>
              <name>GPIO_INT04_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT05_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT06_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT07_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER2_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER4_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OS_EVENT_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEC_HYPERVISOR_CALL_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEC_GPIO_INT00_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEC_GPIO_INT01_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>QDDKEY_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PQ_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDMA1_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_HS_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WAKEUPPADS_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER1 register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTERSET2</name>
          <description>Set bits in STARTER</description>
          <addressOffset>0x6A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELS_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMPER_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC1_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC2_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_CMP0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_CMP1_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HS_CMP2_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_CAPTURE_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_FAULT_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_RELOAD_ERROR_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_COMPARE0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_RELOAD0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_COMPARE1_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_RELOAD1_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_COMPARE2_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_RELOAD2_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_COMPARE3_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM0_RELOAD3_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM1_CAPTURE_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM1_FAULT_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM1_RELOAD_ERROR_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM1_COMPARE0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM1_RELOAD0_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER2 register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
