nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EZHARCHB_INMUX[%s]</name>
          <description>Inputmux register for EZH arch B inputs</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Input number select to EZHARCHB input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0_0</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_1</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_2</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_3</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_4</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_5</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_6</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_7</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_8</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_9</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_10</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_11</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_12</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_13</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_14</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val0_15</name>
                  <description>GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>SCT_OUT8 output from SCTimer, synced to system clock</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>SCT_OUT9 output from SCTimer, synced to system clock</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>MRT_IRQ0 Multi-rate timer interrupt request 0</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>MRT_IRQ1 Multi-rate timer interrupt request 1</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>T4_MAT3 ctimer 4 match[3] output</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>T4_MAT2 ctimer 4 match[2] output</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>T3_MAT3 ctimer 3 match[3] output</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>T3_MAT2 ctimer 3 match[2] output</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>T1_MAT3 ctimer 1 match[3] output</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>T1_MAT2 ctimer 1 match[2] output</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>UTICK0_IRQ Micro-tick timer interrupt, synced to system clock</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>WDT_IRQ Watchdog Timer interrupt request, synced to system clock</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>ADC0_IRQ interrupt request from ADC</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>ACMP0_IRQ Combined Analog comparator interrupt request</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>LSPI_HS_IRQ High speed Serial Peripheral interface interrupt request</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>FLEXCOMM7_IRQ Flexcomm7 interrupt synced to system clock</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>FLEXCOMM6_IRQ Flexcomm6 interrupt synced to system clock</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>FLEXCOMM5_IRQ Flexcomm5 interrupt synced to system clock</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>FLEXCOMM4_IRQ Flexcomm4 interrupt synced to system clock</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>FLEXCOMM3_IRQ Flexcomm3 interrupt synced to system clock</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>FLEXCOMM2_IRQ Flexcomm2 interrupt synced to system clock</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>FLEXCOMM1_IRQ Flexcomm1 interrupt synced to system clock</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>FLEXCOMM0_IRQ Flexcomm0 interrupt synced to system clock</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>DMA0_IRQ DMA0 interrupt request</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>DMA1_IRQ DMA1 interrupt request</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>SYS_IRQ combined WDT_INT Watchdog Timer interrupt request | FLASH_IRQ Flash interrupt request | BOD_IRQ BrownOut Detection interrupt request</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>RTC_COMBO_IRQ Real Time Clock Combined Alarm | Wake-up interrupt request</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>ARM_TXEV interrupt event from CPU0</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>GPIOINT_BMATCH GPIO_INT boolean pattern match output</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>ACMP_OUT output from analog comparator</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>USB0_FRAME_TOGGLE</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>OSTIMER_IRQ OS Timer interrupt request</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>ADC1 interrupt</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>HSCOMP0_IRQ/HSCOMP1_IRQ/HSCOMP2_IRQ</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>DAC0 interrupt</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>DAC1/2 interrupt</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>FlexPWM0 interrupt</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>FlexPWM1 interrupt</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>ENC0 interrupt</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>ENC1 interrupt</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>AOI0_OUT0</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val47</name>
                  <description>AOI1_OUT0</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val48</name>
                  <description>TMPR_OUT</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PINTSEL[%s]</name>
          <description>Pin interrupt select</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTPIN</name>
              <description>Pin number select for pin interrupt or pattern match engine input. For PIOx_y: INTPIN = (x * 32) + y. PIO0_0 to PIO1_31 correspond to numbers 0 to 63.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
