nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
        <register>
          <dim>20</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51</dimIndex>
          <name>DMA0_ITRIG_INMUX%s</name>
          <description>Trigger select for DMA0 channel</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Trigger input number (binary value) for DMA channel n (n = 32 to 51).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>FlexSPI_RX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>FlexSPI_TX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>GPIO_INT0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>GPIO_INT1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>GPIO_INT2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>GPIO_INT3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>T0_DMAREQ_M0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>T0_DMAREQ_M1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>T1_DMAREQ_M0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>T1_DMAREQ_M1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>T2_DMAREQ_M0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>T2_DMAREQ_M1</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>T3_DMAREQ_M0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>T3_DMAREQ_M1</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>T4_DMAREQ_M0</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>T4_DMAREQ_M1</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>ACMP0_OUT</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>SDMA0_TRIGOUT_A</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>SDMA0_TRIGOUT_B</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>SDMA0_TRIGOUT_C</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>SDMA0_TRIGOUT_D</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>SCT_DMA0</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>SCT_DMA1</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>ADC0_tcomp[0]</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>ADC1_tcomp[0]</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>HSCMP0</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>HSCMP1</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>HSCMP2</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>AOI0_OUT0</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>AOI0_OUT1</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>AOI0_OUT2</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>AOI0_OUT3</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>AOI1_OUT0</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>AOI1_OUT1</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>AOI1_OUT2</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>AOI1_OUT3</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>FlexPWM0_req_capt0</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>FlexPWM0_req_capt1</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>FlexPWM0_req_capt2</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>FlexPWM0_req_capt3</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>FlexPWM0_req_val0</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>FlexPWM0_req_val1</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>FlexPWM0_req_val2</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>FlexPWM0_req_val3</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>FlexPWM1_req_capt0</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>FlexPWM1_req_capt1</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val47</name>
                  <description>FlexPWM1_req_capt2</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val48</name>
                  <description>FlexPWM1_req_capt3</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>FlexPWM1_req_val0</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>FlexPWM1_req_val1</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>FlexPWM1_req_val2</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>FlexPWM1_req_val3</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val53</name>
                  <description>TMPR_OUT</description>
                  <value>0x34</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_REQEN0</name>
          <description>Enable DMA0 requests</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQ_ENA0</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA1</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA2</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA3</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA4</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA5</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA6</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA7</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA8</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA9</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA10</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA11</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA12</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA13</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA14</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA15</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA16</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA17</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA18</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA19</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA20</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA21</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA22</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA23</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA24</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA25</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA26</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA27</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA28</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA29</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA30</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_ENA31</name>
              <description>Controls the first 32 request inputs of DMA0. If bit i is '1' the DMA request input #i is enabled.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
