nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
        <register>
          <name>LIFECYCLESTATE</name>
          <description>Life Cycle State</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>LC</name>
              <description>Life Cycle state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSPWR</name>
          <description>Power status</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x9</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DCDCPWROK</name>
              <description>DCDC converter power OK.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LDOCOREPWROK</name>
              <description>CORE LDO power OK.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSCLK</name>
          <description>Clock status</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>XTAL32KOK</name>
              <description>XTAL oscillator 32 K OK signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL32KOSCFAILURE</name>
              <description>XTAL32 KHZ oscillator oscillation failure detection indicator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOFAIL</name>
                  <description>No oscillation failure has been detetced since the last time this bit has been cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAILURE</name>
                  <description>At least one oscillation failure has been detetced since the last time this bit has been cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AOREG0</name>
          <description>Always-on 0</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_15_0</name>
              <description>General purpose always on domain data storage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AOREG1</name>
          <description>Always-on 1</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POR</name>
              <description>The last chip reset was caused by a Power On Reset.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PADRESET</name>
              <description>The last chip reset was caused by a Pin Reset.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BODRESET</name>
              <description>The last chip reset was caused by a Brown Out Detector (BoD), either BOD_VDDMAIN or BOD_CORE.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTEMRESET</name>
              <description>The last chip reset was caused by a System Reset requested by the ARM CPU.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTRESET</name>
              <description>The last chip reset was caused by the Watchdog Timer.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRRESET</name>
              <description>The last chip reset was caused by a Software event.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDRESET_WAKEUPIO</name>
              <description>A Wake-up I/O reset event occured during DEEP-POWER-DOWN mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDRESET_RTC</name>
              <description>A RTC event occured during DEEP-POWER-DOWN mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDRESET_OSTIMER</name>
              <description>An OS Timer event occured during a DEEP-POWER-DOWN mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CDOGRESET</name>
              <description>The last chip reset was caused by the code Watchdog.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPD_EVENTS_ORDER</name>
              <description>In DEEP-POWER-DOWN mode, indicates which reset event occured first, between a wake up I/O event (in DEEP-POWER-DOWN), a RTC event (in DEEP-POWER-DOWN) and a OS Timer event (in DEEP-POWER-DOWN). May be usefull when several reset events are enabled during DEEP-POWER-DOWN.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUPIO</name>
                  <description>WAKEUPIO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC</name>
                  <description>RTC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUPIO_RTC</name>
                  <description>Both WAKEUPIO and RTC events occured at the same time (the 2 events occured within 1 nano-second of each other)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSTIMER</name>
                  <description>OSTIMER</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUPIO_OSTIMER</name>
                  <description>Both WAKEUPIO and OSTIMER events occured at the same time (the 2 events occured within 1 nano-second of each other)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OSTIMER</name>
                  <description>Both RTC and OSTIMER events occured at the same time (the 2 events occured within 1 nano-second of each other)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUPIO_RTC_OSTIMER</name>
                  <description>WAKEUPIO, RTC and OSTIMER events occured at the same time (the 3 events occured within 1 nano-second of each other)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTERRORCOUNTER</name>
              <description>ROM Boot Fatal Error Counter.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISCCTRL</name>
          <description>Miscellaneous control</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1FFFF</resetMask>
          <fields>
            <field>
              <name>VREF_ISO</name>
              <description>VREF isolation control.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>VREF module isolation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>VREF module isolation is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCOSC32K</name>
          <description>32 KHz clocks source control</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xC7FF800F</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Select the 32K oscillator to be used in for the RTC, the OS Event Timer and the rest of the SoC (either XTAL32KHz or FRO32KHz) .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO32K</name>
                  <description>FRO 32 KHz.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL32K</name>
                  <description>XTAL 32KHz.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSEVENTTIMER</name>
          <description>OS Event Timer control</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>SOFTRESET</name>
              <description>Active high reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLOCKENABLE</name>
              <description>Enable OSTIMER 32 KHz clock.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDWAKEUPENABLE</name>
              <description>Wake up enable in Deep Power Down mode (To be used in Enable Deep Power Down mode).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELCLOCK</name>
              <description>Select OS Event Timer Clock source</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO32KHZ</name>
                  <description>32-KHz Free Running Oscillator (FRO)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL32KHZ</name>
                  <description>32-KHz Crystal Oscillator (XTAL)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO1MHZ</name>
                  <description>1-MHz FRO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>System Bus clock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSLEEPCFG1</name>
          <description>Power down sleep configuration 1</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>PDEN_CMPBIAS</name>
              <description>Controls Comparators 1/2/3 Bias power during DEEP-SLEEP (always shut down during POWER-DOWN &amp; DEEP-POWER-DOWN).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>Analog Bias is powered on during low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>Analog Bias is powered off during low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_HSCMP0_DAC</name>
              <description>Controls High Speed Comparator0 DAC power during DEEP-SLEEP (always shut down during POWER-DOWN &amp; DEEP-POWER-DOWN).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>High Speed Comparator0 DAC is powered on during low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>High Speed Comparator0 DAC is powered off during low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_HSCMP1_DAC</name>
              <description>Controls High Speed Comparator1 DAC power during DEEP-SLEEP (always shut down during POWER-DOWN &amp; DEEP-POWER-DOWN).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>High Speed Comparator1 DAC is powered on during low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>High Speed Comparator1 DAC is powered off during low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_HSCMP2_DAC</name>
              <description>Controls High Speed Comparator2 DAC power during DEEP-SLEEP (always shut down during POWER-DOWN &amp; DEEP-POWER-DOWN).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>High Speed Comparator2 DAC is powered on during low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>High Speed Comparator2 DAC is powered off during low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_DAC0</name>
              <description>Controls DAC0 power during DEEP-SLEEP &amp; POWER-DOWN (always shut down during DEEP-POWER-DOWN).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>DAC0 is powered on during low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>DAC0 is powered off during low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_DAC1</name>
              <description>Controls DAC1 power during DEEP-SLEEP &amp; POWER-DOWN (always shut down during DEEP-POWER-DOWN).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>DAC1 is powered on during low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>DAC1 is powered off during low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_DAC2</name>
              <description>Controls DAC2 power during DEEP-SLEEP &amp; POWER-DOWN (always shut down during DEEP-POWER-DOWN).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>DAC2 is powered on during low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>DAC2 is powered off during low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPEN_DAC0</name>
              <description>Controls DAC0 Stop mode during DEEP-SLEEP &amp; POWER-DOWN (DAC stop mode is always disabled in DEEP-POWER-DOWN).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPDISABLE</name>
                  <description>DAC Stop Mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPENABLE</name>
                  <description>DAC Stop Mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPEN_DAC1</name>
              <description>Controls DAC1 Stop mode during DEEP-SLEEP &amp; POWER-DOWN (DAC stop mode is always disabled in DEEP-POWER-DOWN).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPDISABLE</name>
                  <description>DAC Stop Mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPENABLE</name>
                  <description>DAC Stop Mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPEN_DAC2</name>
              <description>Controls DAC2 Stop mode during DEEP-SLEEP &amp; POWER-DOWN (DAC stop mode is always disabled in DEEP-POWER-DOWN).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPDISABLE</name>
                  <description>DAC Stop Mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPENABLE</name>
                  <description>DAC Stop Mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
