nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI_FILTER</name>
      <description>SPI FILTER</description>
      <groupName>SPI_FILTER</groupName>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI_FILTER</name>
        <value>45</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P1_ACT_SEL</name>
              <description>Active Chip Select for P1 filter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_ACT_SEL0</name>
                  <description>Sets CS0 as the read location for the firmware image and sets CS1 as the write location for the FW image.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_ACT_SEL1</name>
                  <description>Sets CS1 as the read location for the firmware image and sets CS0 as the write location for the FW image.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_BYTE_SEL</name>
              <description>Address Byte Select Mode for P1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_BYTE_SEL0</name>
                  <description>Sets the filter to 4-byte address mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_BYTE_SEL1</name>
                  <description>Sets the filter to 3-byte address mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_BYTE_SEL_MD</name>
              <description>Address Byte Select Mode for P1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_BYTE_SEL_MD0</name>
                  <description>Normal Operation. The Address byte mode is determined by the Op Code Command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_BYTE_SEL_MD1</name>
                  <description>Sets the Byte Mode to 3-byte and gives control of the function to the P1_BYTE_SEL in the P1 Filter Control Register. In this mode, any changes to P1_BYTE_SEL are latched and the internal state of P1_BYTE_SEL will retain this value when P1_BYTE_SEL_MD is cleared</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_DIRTY_CLR</name>
              <description>Clear dirty state for P1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1_FLT_EN</name>
              <description>Filter Enable bit for P1 filter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILT_DISABLE</name>
                  <description>Filter Disabled. All CS Disable outputs are asserted so that host access to the flash devices is disabled. CS# inputs to the filter are disabled so that the filter state machine is locked in its current state. All register controls remain functional.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILT_ENABLE</name>
                  <description>Filter Enabled. CS# inputs to the filter are enabled and the filter state machine controls the CS disable outputs. This bit takes priority over the P1_BYP_EN bit in the Test Control Register. Setting this bit will enable filtering and will enable communication to flash devices regardless of the state of P1_BYP_EN. All other register controls remain functional while filtering is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_FLASH_MD</name>
              <description>Flash Mode Select for P1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_FLASH_MD_DFM</name>
                  <description>Dual Flash Mode. Supports two separate physical flash devices as described in Section 3.1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_FLASH_MD_SFM</name>
                  <description>Single Flash Mode. Supports a single physical flash device as described in Section 3.2. Note that all Chip Erase Op Codes are blocked when in this mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_ACT_SEL</name>
              <description>Active Chip Select for P0 filter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_ACT_SEL0</name>
                  <description>Sets CS0 as the read location for the firmware image and sets CS1 as the write location for the FW image.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_ACT_SEL1</name>
                  <description>Sets CS1 as the read location for the firmware image and sets CS0 as the write location for the FW image.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_BYTE_SEL</name>
              <description>Address Byte Select for P0 filter</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_BYTE_SEL0</name>
                  <description>Sets the filter to 3-byte address mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_BYTE_SEL1</name>
                  <description>Sets the filter to 4-byte address mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_BYTE_SEL_MD</name>
              <description>Address Byte Select Mode for P0 filter</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_BYTE_SEL_MD_0</name>
                  <description>Normal Operation. The Address byte mode is determined by the Op Code Command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_BYTE_SEL_MD_1</name>
                  <description>Sets the Byte Mode to 3-byte and gives control of the function to the P0_BYTE_SEL in the P0 Filter Control Register. In this mode, any changes to P0_BYTE_SEL are latched and the internal state of BYTE_SEL will retain this value when P0_BYTE_SEL_MD is cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_DIRTY_CLR</name>
              <description>Clear dirty state for P0</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P0_FLT_EN</name>
              <description>Filter Enable bit for P0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLT_ENABLE</name>
                  <description>Filter Enabled. CS# inputs to the filter are enabled and the filter state machine controls the CS disable outputs. CS# inputs to the filter are enabled so that the filter state machine is active. All other register controls are functional.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLT_DISABLE</name>
                  <description>Filter Disabled. All CS Disable outputs are asserted so that host access to the flash devices is disabled. CS# inputs to the filter are disabled so that the filter state machine is locked in its current state. All other register controls can be accessed, but have no impact on the functionality of the filter while the filter is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_FLASH_MD</name>
              <description>Flash Mode Select for P0</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFM</name>
                  <description>Dual Flash Mode. Supports two separate physical flash devices as described in Section 3.1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFM</name>
                  <description>Single Flash Mode. Supports a single physical flash device as described in Section 3.2. Note that all Chip Erase Op Codes are blocked when in this mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P0_DIRTY_INT</name>
              <description>Indicates dirty state of the inactive Flash for P0 filter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_DIRTY_INT0</name>
                  <description>Indicates normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_DIRTY_INT1</name>
                  <description>Indicates that a write has occurred to the FW Code region of the inactive Flash and that flash is now considered corrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_DIRTY_INT</name>
              <description>Indicates dirty state of the inactive Flash for P1 filter</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_DIRTY_INT0</name>
                  <description>Indicates normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_DIRTY_INT1</name>
                  <description>Indicates that a write has occurred to the FW Code region of the inactive Flash and that flash is now considered corrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_BLK_INT</name>
              <description>Indicates Port 0 Blocked Op Code</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_BLK_INT0</name>
                  <description>Indicates normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_BLK_INT1</name>
                  <description>Indicates that a blocked opcode has been detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_BLK_INT</name>
              <description>Indicates Port 1 Blocked Op Code</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_BLK_INT0</name>
                  <description>Indicates normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_BLK_INT1</name>
                  <description>Indicates that a blocked opcode has been detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_BYTEMODE_INT</name>
              <description>Indicates Port 0 Bytemode interrupt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_BYTEMODE_INT0</name>
                  <description>Indicates normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_BYTEMODE_INT1</name>
                  <description>Indicates that a Bytemode change has been detected (OpCode E9 or B7)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_BYTEMODE_INT</name>
              <description>Indicates Port 1 Bytemode interrupt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_BYTEMODE_INT0</name>
                  <description>Indicates normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_BYTEMODE_INT1</name>
                  <description>Indicates that a Bytemode change has been detected (OpCode E9 or B7)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_F8_INT</name>
              <description>Indicates Port 0 F8 Op Code Command Interrupt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_F8_INT0</name>
                  <description>Indicates normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_F8_INT1</name>
                  <description>Indicates an F8 command has been detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_F8_INT</name>
              <description>Indicates Port 1 F8 Op Code Command Interrupt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_F8_INT0</name>
                  <description>Indicates normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_F8_INT1</name>
                  <description>Indicates an F8 command has been detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
