nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P0_DIRTY_MASK</name>
              <description>Mask bit for P0_DIRTY_INT</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_DIRTY_MASK0</name>
                  <description>Indicates P0_DIRTY_INT interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_DIRTY_MASK1</name>
                  <description>Indicates P0_DIRTY_INT interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_DIRTY_MASK</name>
              <description>Mask bit for P1_DIRTY_INT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_DIRTY_MASK0</name>
                  <description>Indicates normal operation. P1_DIRTY_INT interrupt is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_DIRTY_MASK1</name>
                  <description>Indicates P1_DIRTY_INT interrupt is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_BLK_MASK</name>
              <description>Mask bit for P0_BLK_MASK</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_BLK_MASK0</name>
                  <description>Indicates P0_BLK_MASK is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_BLK_MASK1</name>
                  <description>Indicates P0_BLK_MASK is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_BLK_MASK</name>
              <description>Mask bit for P1_BLK_MASK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_BLK_MASK0</name>
                  <description>Indicates P1_BLK_MASK is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_BLK_MASK1</name>
                  <description>Indicates P1_BLK_MASK is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_BYTEMODE_MASK</name>
              <description>Mask bit for P0_BYTEMODE_MASK</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_BYTEMODE_MASK0</name>
                  <description>Indicates P0_BYTEMODE_MASK is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_BYTEMODE_MASK1</name>
                  <description>Indicates P0_BYTEMODE_MASK is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_BYTEMODE_MASK</name>
              <description>Mask bit for P1_BYTEMODE_MASK</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_BYTEMODE_MASK0</name>
                  <description>Indicates P1_BYTEMODE_MASK is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_BYTEMODE_MASK1</name>
                  <description>Indicates P1_BYTEMODE_MASK is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_F8_MASK</name>
              <description>Mask bit for P0_F8_MASK</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_F8_MASK0</name>
                  <description>Indicates P0_F8_MASK is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_F8_MASK1</name>
                  <description>Indicates P0_F8_MASK is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_F8_MASK</name>
              <description>Mask bit for P1_F8_MASK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates P1_F8_MASK is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates P1_F8_MASK is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P1_DIRTY</name>
              <description>Indicates the Dirty State of the P1 inactive Flash</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates normal operation. No Writes have been directed to the inactive Flash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that a write to the inactive Flash has been detected and the state of the flash should be considered &quot;dirty&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_BYTE_MODE</name>
              <description>Indicates the P1 Address Byte Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_BYTE_MODE_0</name>
                  <description>3-Byte Address Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_BYTE_MODE_1</name>
                  <description>4-Byte Address Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_DIRTY</name>
              <description>Indicates the Dirty State of the P0 inactive Flash</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_DIRTY_0</name>
                  <description>Indicates normal operation. No Writes have been directed to the inactive Flash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_DIRTY_1</name>
                  <description>Indicates that a write to the inactive Flash has been detected and the state of the flash should be considered &quot;dirty&quot;.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_BYTE_MODE</name>
              <description>Indicates the P0 Address Byte Mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_BYTE_MODE_0</name>
                  <description>3-Byte Address Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_BYTE_MODE_1</name>
                  <description>4-Byte Address Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <description>Test Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x11000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P0_BYP_SEL</name>
              <description>Selects the active CS when PO_BYP_EN is set</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_BYP_SEL_0</name>
                  <description>CS0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P0_BYP_SEL_1</name>
                  <description>CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_BYP_EN</name>
              <description>Enables bypassing of the filter logic</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Filter Bypass Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Filter Bypass Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_BYP_SEL</name>
              <description>Selects the active CS when P1_BYP_EN is set</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P1_BYP_SEL_0</name>
                  <description>CS0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_BYP_SEL_1</name>
                  <description>CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_BYP_EN</name>
              <description>Enables bypassing of the filter logic</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Filter Bypass Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Filter Bypass Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_MFG_ID</name>
              <description>Sets the Flash memory manufacturer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MACRONIX</name>
                  <description>Macronix</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WINDBOND</name>
                  <description>Windbond</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICRON</name>
                  <description>Micron</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P1_MFG_ID</name>
              <description>Sets the Flash memory manufacturer</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MACRONIX</name>
                  <description>Macronix</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WINDBOND</name>
                  <description>Windbond</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICRON</name>
                  <description>Micron</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>P0FAR1</name>
          <description>Port 0 filter address region 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS_LOWER_LSBS</name>
              <description>Address Lower LSBs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_LOWER_MSBS</name>
              <description>Address Lower MSBs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_UPPER_LSBS</name>
              <description>Address Upper LSBs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_UPPER_MSBS</name>
              <description>Address Upper MSBs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P0FAR2</name>
          <description>Port 0 filter address region 2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS_LOWER_LSBS</name>
              <description>Address Lower LSBs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_LOWER_MSBS</name>
              <description>Address Lower MSBs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_UPPER_LSBS</name>
              <description>Address Upper LSBs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_UPPER_MSBS</name>
              <description>Address Upper MSBs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P0FAR3</name>
          <description>Port 0 filter address region 3</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS_LOWER_LSBS</name>
              <description>Address Lower LSBs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_LOWER_MSBS</name>
              <description>Address Lower MSBs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_UPPER_LSBS</name>
              <description>Address Upper LSBs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_UPPER_MSBS</name>
              <description>Address Upper MSBs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1FAR1</name>
          <description>Port 1 filter address region 1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS_LOWER_LSBS</name>
              <description>Address Lower LSBs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_LOWER_MSBS</name>
              <description>Address Lower MSBs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_UPPER_LSBS</name>
              <description>Address Upper LSBs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_UPPER_MSBS</name>
              <description>Address Upper MSBs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1FAR2</name>
          <description>Port 1 filter address region 2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS_LOWER_LSBS</name>
              <description>Address Lower LSBs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_LOWER_MSBS</name>
              <description>Address Lower MSBs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_UPPER_LSBS</name>
              <description>Address Upper LSBs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS_UPPER_MSBS</name>
              <description>Address Upper MSBs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
