nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
        <register>
          <name>FILTER01_CFG</name>
          <description>Tamper 01 Filter Configuration</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FIL_DUR1</name>
              <description>Tamper Detect Bit 1 Filter Duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Filtering operation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_1</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_2</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_3</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_4</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_5</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_6</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_7</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_8</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_9</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_10</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_11</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_12</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_13</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_14</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_15</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_SEL1</name>
              <description>Tamper Filter 1 Clock Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_32KHZ</name>
                  <description>32 kHz clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_512HZ</name>
                  <description>512 Hz clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_128HZ</name>
                  <description>128 Hz clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_64HZ</name>
                  <description>64 Hz clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_16HZ</name>
                  <description>16 Hz clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_8HZ</name>
                  <description>8 Hz clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_4HZ</name>
                  <description>4 Hz clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_2HZ</name>
                  <description>2 Hz clock</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POL1</name>
              <description>Tamper Detect Input Bit 1 Polarity Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_HIGH</name>
                  <description>Tamper detect input bit 1 is active high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_LOW</name>
                  <description>Tamper detect input bit 1 is active low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIL_DUR0</name>
              <description>Tamper Detect Bit 0 Filter Duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Filtering operation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_1</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_2</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_3</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_4</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_5</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_6</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_7</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_8</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_9</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_10</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_11</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_12</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_13</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_14</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUMBER_OF_CLK_CYCLES_ENABLED_15</name>
                  <description>Number of tamper filter clock cycles to be counted when tamper is asserted.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_SEL0</name>
              <description>Tamper Filter 0 Clock Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_32KHZ</name>
                  <description>32 kHz clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_512HZ</name>
                  <description>512 Hz clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_128HZ</name>
                  <description>128 Hz clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_64HZ</name>
                  <description>64 Hz clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_16HZ</name>
                  <description>16 Hz clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_8HZ</name>
                  <description>8 Hz clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_4HZ</name>
                  <description>4 Hz clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_2HZ</name>
                  <description>2 Hz clock</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POL0</name>
              <description>Tamper Detect Input Bit 0 Polarity Control</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_HIGH</name>
                  <description>Tamper detect input bit 0 is active high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_LOW</name>
                  <description>Tamper detect input bit 0 is active low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
