nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>CACHE64_POLSEL0</name>
      <description>CACHE64_POLSEL</description>
      <alternatePeripheral>CACHE64_CTRL0</alternatePeripheral>
      <groupName>CACHE64_POLSEL</groupName>
      <baseAddress>0x4002E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG0_TOP</name>
          <description>Region 0 Top Boundary</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2AAA800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG0_TOP</name>
              <description>Upper Limit Of Region 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG1_TOP</name>
          <description>Region 1 Top Boundary</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5555400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG1_TOP</name>
              <description>Upper Limit Of Region 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POLSEL</name>
          <description>Policy Select</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG0_POLICY</name>
              <description>Policy Select For Region 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG0_00</name>
                  <description>Noncacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_01</name>
                  <description>Write-through</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_10</name>
                  <description>Write-back</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_11</name>
                  <description>Invalid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG1_POLICY</name>
              <description>Policy Select For Region 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG1_00</name>
                  <description>Noncacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_01</name>
                  <description>Write-through</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_10</name>
                  <description>Write-back</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_11</name>
                  <description>Invalid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG2_POLICY</name>
              <description>Policy Select For Region 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG2_00</name>
                  <description>Noncacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_01</name>
                  <description>Write-through</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_10</name>
                  <description>Write-back</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_11</name>
                  <description>Invalid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PKC</name>
      <description>no description available</description>
      <groupName>PKC</groupName>
      <baseAddress>0x4002F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PKC</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>PKC_ERR</name>
        <value>113</value>
      </interrupt>
      <registers>
        <register>
          <name>pkc_status</name>
          <description>Status register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x6F</resetMask>
          <fields>
            <field>
              <name>activ</name>
              <description>PKC active: ACTIV=1 signals that a calculation is in progress or about to start. At the end of a calculation ACTIV is automatically reset to logic 0 in case no further GO bit is set. If the next PKC operation has been started by setting a GO bit during a calculation, ACTIV remains high. ACTIV is always '1' in case PKC_STATUS.GOANY is set. ACTIV is always '0' in case PKC_CTRL_RESET is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>carry</name>
              <description>Carry overflow flag: CARRY is set by the PKC at the end of a calculation in case</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>zero</name>
              <description>Zero result flag: ZERO is set by the PKC at the end of a calculation in case the result of the calculation is equal zero. ZERO is updated for each PKC calculation mode, except for MUL1 (opcode 0x20) and MUL1_GF2 (opcode 0x24).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>goany</name>
              <description>Combined GO status flag: GOANY is set in case either PKC_CTRL.GOD1, GOD2, GOM1, GOM2 or GOU is set. The 1-to-0 transition of GOANY indicates that a calculation has been started and that a new GO bit can be set. If GOANY is cleared also all PKC_STATUS.LOCKED bits are cleared to indicate that the parameter set can be updated. GOANY is always '0' in case PKC_CTRL.RESET is set.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved4</name>
              <description>reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>locked</name>
              <description>Parameter set locked: Indicates if parameter set is locked due to a pending calculation start or can be overwritten.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_ctrl</name>
          <description>Control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>reset</name>
              <description>PKC reset control bit: RESET=1 enforces the PKC's reset state during which a calculation cannot be started and by which any ongoing calculation process is stopped. RESET can be set/cleared by the CPU in order to switch between PKC reset and calculation enable. RESET=1 is the default state after a chip reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>stop</name>
              <description>Freeze PKC calculation: STOP=1 freezes all PKC activity incl. RAM accesses and reduces the PKC power consumption to its minimum. The difference compared to the reset of the PKC is that a stopped calculation can be continued when STOP is released (reset to '0') again. The status flags are not affected by the STOP control bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>god1</name>
              <description>Control bit to start direct operation using parameter set 1: If GOD1 is set PKC will start a direct / layer0 operation using parameter set 1 (PKC_MODE1, PKC_XYPTR1, PKC_ZRPTR1, PKC_LEN1).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>god2</name>
              <description>Control bit to start direct operation using parameter set 2: If GOD2 is set PKC will start a direct / layer0 operation using parameter set 2 (PKC_MODE2, PKC_XYPTR2, PKC_ZRPTR2, PKC_LEN2).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>gom1</name>
              <description>Control bit to start MC pattern using parameter set 1: If GOM1 is set PKC will start a MC pattern / layer1 operation using parameter set 1 (PKC_MODE1, PKC_XYPTR1, PKC_ZRPTR1, PKC_LEN1).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>gom2</name>
              <description>Control bit to start MC pattern using parameter set 2: If GOM2 is set PKC will start a MC pattern / layer1 operation using parameter set 2 (PKC_MODE2, PKC_XYPTR2, PKC_ZRPTR2, PKC_LEN2).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>gou</name>
              <description>Control bit to start pipe operation: If GOU is set PKC will start the pipe / layer2 operation (parameter fetch &amp; calculation) described in section 'PKC Universal Pointer Fetch Operation'.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>gf2conv</name>
              <description>Convert to GF2 calculation modes: If GF2CONV is set operations are mapped to their GF(2) equivalent operation modes.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>clrcache</name>
              <description>Clear universal pointer cache: Invalidates the cache such that all previously fetched parameters are withdrawn and have to be fetched again via DMA accesses.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>cache_en</name>
              <description>Enable universal pointer cache: If CACHE_EN=1 the cache for the universal pointer parameters is enabled. In case a parameter value is found in the cache (from a previous fetch) no DMA access is triggered. As such the amount of DMA accesses for the parameter fetch vary between 0 and 4. To further optimize the cache utilization not used parameters, e.g. XPTR for a plain addition (opcode 0x0A), could be defined equal to a used one (e.g. equal YPTR or RPTR) or a previously fetched parameter.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>redmul</name>
              <description>Reduced multiplier mode: REDMUL defines the operand width processed by the PKC coprocessor.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fullsz</name>
                  <description>full size mode, 3 least significant bits of pointer and length are ignored, minimum supported length 0x0008</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_32bit</name>
                  <description>RFU Error Generated if selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_64bit</name>
                  <description>64-bit mode, 3 least significant bits of pointer and length are ignored, minimum supported length 0x0008</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_128bit</name>
                  <description>RFU Error Generated if selected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_cfg</name>
          <description>Configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x719</resetValue>
          <resetMask>0x7FF</resetMask>
          <fields>
            <field>
              <name>idleop</name>
              <description>Idle operation feature not available in this version (flag is don't care).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rfu1</name>
              <description>RFU</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rfu2</name>
              <description>RFU</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>clkrnd</name>
              <description>Clock randomization feature not available in this version (flag is don't care).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>redmulnoise</name>
              <description>Noise in reduced multiplier mode feature not available in this version (flag is don't care).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rnddly</name>
              <description>Random delay feature not available in this version (flag is don't care).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sbxnoise</name>
              <description>Noise feature not available in this version (flag is don't care).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>alpnoise</name>
              <description>Noise feature not available in this version (flag is don't care).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>fmulnoise</name>
              <description>Noise feature not available in this version (flag is don't care).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_mode1</name>
          <description>Mode register, parameter set 1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>mode</name>
              <description>Calculation Mode / MC Start address:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_xyptr1</name>
          <description>X+Y pointer register, parameter set 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xptr</name>
              <description>Start address of X operand in PKCRAM with byte granularity: Least significant bits are ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on available PKCRAM size.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>yptr</name>
              <description>Start address of Y operand in PKCRAM with byte granularity: Least significant bits are ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on available PKCRAM size.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_zrptr1</name>
          <description>Z+R pointer register, parameter set 1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>zptr</name>
              <description>Start address of Z operand in PKCRAM with byte granularity or constant for calculation modes using CONST:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rptr</name>
              <description>Start address of R result in PKCRAM with byte granularity: Least significant bits are ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on available PKCRAM size.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_len1</name>
          <description>Length register, parameter set 1</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>len</name>
              <description>Operand length: LEN defines the length of the operands and the result in bytes. The length of Y, Z and R depend furthermore on the selected calculation mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mclen</name>
              <description>Loop counter for microcode pattern: MCLEN defines the length of the loop counter that can be used in layer1 calculation mode, e.g. in MC opcode DecrTBNZ. For the hardcoded MC patterns Modular Multiplication (MC start address 0x00), Plain Multiplication (0x13), Plain Multiplication with Addition (0x1D) and Modular Reduction (0x33) MCLEN defines the length of the X operand in bytes.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
