nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PUF_DEFAULT</name>
      <description>PUF Key Context Management</description>
      <groupName>PUF</groupName>
      <headerStructName>PUF</headerStructName>
      <baseAddress>0x4003A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PUF</name>
        <value>56</value>
      </interrupt>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>PUF command blocking configuration</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIS_PUF_ENROLL</name>
              <description>Disable PUF enroll command</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_PUF_START</name>
              <description>Disable PUF start command</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_PUF_STOP</name>
              <description>Disable PUF stop command</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_PUF_GET_KEY</name>
              <description>Disable PUF get key command</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_PUF_UNWRAP_KEY</name>
              <description>Disable PUF unwrap key command</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_PUF_GEN_WRAP_KEY</name>
              <description>Disable PUF generate and wrap key command</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_PUF_WRAP_KEY</name>
              <description>Disable PUF wrap key command</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_PUF_GEN_RANDOM_NUMBER</name>
              <description>Disable PUF generate and wrap key command</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_PUF_TEST</name>
              <description>Disable PUF test command</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_LOCK</name>
          <description>Lock the security level of PUF block until key generate, wrap or unwrap operation is completed.</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_LEVEL</name>
              <description>Disable PUF enroll command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSU</name>
                  <description>Nonsecure user</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANTI_POLE_SEC_LEVEL</name>
              <description>Anti-pole of security level</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PATTERN</name>
              <description>Pattern</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APP_CTX_MASK</name>
          <description>Application defined context mask</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APP_CTX_MASK</name>
              <description>Application defined context</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="PUF_DEFAULT">
      <name>PUF_ALIAS1</name>
      <description>PUF Key Context Management</description>
      <groupName>PUF</groupName>
      <baseAddress>0x4003B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PUF</name>
        <value>56</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PUF_DEFAULT">
      <name>PUF_ALIAS2</name>
      <description>PUF Key Context Management</description>
      <groupName>PUF</groupName>
      <baseAddress>0x4003C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PUF</name>
        <value>56</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PUF_DEFAULT">
      <name>PUF_ALIAS3</name>
      <description>PUF Key Context Management</description>
      <groupName>PUF</groupName>
      <baseAddress>0x4003D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PUF</name>
        <value>56</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>QK0</name>
      <description>PUF</description>
      <alternatePeripheral>PUF_DEFAULT</alternatePeripheral>
      <groupName>QK</groupName>
      <baseAddress>0x4003A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x3F0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZEROIZE</name>
              <description>Zeroize operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENROLL</name>
              <description>Enroll operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>Start operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GET_KEY</name>
              <description>Get Key operation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNWRAP</name>
              <description>Unwrap operation</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRAP_GENERATED_RANDOM</name>
              <description>Wrap Generated Random operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRAP</name>
              <description>Wrap operation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GENERATE_RANDOM</name>
              <description>Generate Random operation</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_PUF</name>
              <description>Test PUF operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORR</name>
          <description>Operation Result</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT_CODE</name>
              <description>Result code of last operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OK</name>
                  <description>Indicates that the last operation was successful or operation is in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PRODUCT</name>
                  <description>Indicates that the AC is not for the current product/version.</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PRODUCT_PH2</name>
                  <description>Indicates that the AC in the second phase is not for the current product/version.</description>
                  <value>0xF1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_TRANSFER</name>
                  <description>Indicates that the AC is corrupted.</description>
                  <value>0xF2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_TRANSFER_PH2</name>
                  <description>Indicates that the AC in the second phase is corrupted.</description>
                  <value>0xF3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_AUTH</name>
                  <description>Indicates that the authentication of the provided AC failed.</description>
                  <value>0xF4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_AUTH_PH2</name>
                  <description>Indicates that the authentication of the provided AC failed in the second phase.</description>
                  <value>0xF5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PUF_QUALITY</name>
                  <description>Indicates that the SRAM PUF quality verification fails.</description>
                  <value>0xF6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_CONTEXT</name>
                  <description>Indicates that the incorrect or unsupported context is provided.</description>
                  <value>0xF7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_DESTINATION</name>
                  <description>Indicates that a data destination was set that is not allowed according to other settings and the current PUF state.</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAILURE</name>
                  <description>Indicates that the PUF SRAM access has failed.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_OPERATION</name>
              <description>Last operation type</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_PROGRESS</name>
                  <description>Indicates that the operation is in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_ENROLL</name>
                  <description>Indicates that the last operation was Enroll.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_START</name>
                  <description>Indicates that the last operation was Start.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_STOP</name>
                  <description>Indicates that the last operation was Stop.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_GET_KEY</name>
                  <description>Indicates that the last operation was Get Key.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_UNWRAP</name>
                  <description>Indicates that the last operation was Unwrap.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_WRAP_GEN_RND</name>
                  <description>Indicates that the last operation was Wrap Generated Random.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_WRAP</name>
                  <description>Indicates that the last operation was Wrap.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_GEN_RND</name>
                  <description>Indicates that the last operation was Generate Random.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_TEST_MEMORY</name>
                  <description>Indicates that the last operation was Test Memory.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_TEST_PUF</name>
                  <description>Indicates that the last operation was Test PUF.</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_INITIALIZATION</name>
                  <description>Indicates that the last operation was Initialization.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_ZEROIZE</name>
                  <description>Indicates that the last operation was Zeroize.</description>
                  <value>0x2F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Operation in progress</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OK</name>
              <description>Last operation successful</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERROR</name>
              <description>Last operation failed</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZEROIZED</name>
              <description>Zeroized or Locked state</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REJECTED</name>
              <description>Operation rejected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DI_REQUEST</name>
              <description>Indicates the request for data in transfer via the DIR register</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DO_REQUEST</name>
              <description>Indicates the request for data out transfer via the DOR register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
