nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <description>I2C Bus Interface</description>
      <alternatePeripheral>FLEXCOMM1</alternatePeripheral>
      <groupName>I2C</groupName>
      <baseAddress>0x40087000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM1</name>
        <value>15</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C2</name>
      <description>I2C Bus Interface</description>
      <alternatePeripheral>FLEXCOMM2</alternatePeripheral>
      <groupName>I2C</groupName>
      <baseAddress>0x40088000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM2</name>
        <value>16</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C3</name>
      <description>I2C Bus Interface</description>
      <alternatePeripheral>FLEXCOMM3</alternatePeripheral>
      <groupName>I2C</groupName>
      <baseAddress>0x40089000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM3</name>
        <value>17</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C4</name>
      <description>I2C Bus Interface</description>
      <alternatePeripheral>FLEXCOMM4</alternatePeripheral>
      <groupName>I2C</groupName>
      <baseAddress>0x4008A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM4</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C5</name>
      <description>I2C Bus Interface</description>
      <alternatePeripheral>FLEXCOMM5</alternatePeripheral>
      <groupName>I2C</groupName>
      <baseAddress>0x40096000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM5</name>
        <value>19</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C6</name>
      <description>I2C Bus Interface</description>
      <alternatePeripheral>FLEXCOMM6</alternatePeripheral>
      <groupName>I2C</groupName>
      <baseAddress>0x40097000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM6</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C7</name>
      <description>I2C Bus Interface</description>
      <alternatePeripheral>FLEXCOMM7</alternatePeripheral>
      <groupName>I2C</groupName>
      <baseAddress>0x40098000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM7</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>I2S0</name>
      <description>I2S Interface</description>
      <alternatePeripheral>FLEXCOMM0</alternatePeripheral>
      <groupName>I2S</groupName>
      <headerStructName>I2S</headerStructName>
      <baseAddress>0x40086000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXCOMM0</name>
        <value>14</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG1</name>
          <description>Configuration Register 1 for the Primary Channel Pair</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1F3FFF</resetMask>
          <fields>
            <field>
              <name>MAINENABLE</name>
              <description>Main Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAPAUSE</name>
              <description>Data Flow Pause</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAUSE</name>
                  <description>Pause</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAIRCOUNT</name>
              <description>Pair Count</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAIRS_1</name>
                  <description>One Pair</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAIRS_2</name>
                  <description>Two Pairs</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAIRS_3</name>
                  <description>Three Pairs</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAIRS_4</name>
                  <description>Four Pairs</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTSLVCFG</name>
              <description>Master/Slave Configuration Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_SLAVE_MODE</name>
                  <description>Normal Slave Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WS_SYNC_MASTER</name>
                  <description>WS Synchronized Master Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_USING_SCK</name>
                  <description>Master Using an Existing SCK Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_MASTER</name>
                  <description>Normal Master Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLASSIC_MODE</name>
                  <description>Classic Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_MODE_WS_50_DUTYCYCLE</name>
                  <description>DSP mode WS 50% duty cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_MODE_WS_1_CLOCK</name>
                  <description>DSP mode WS 1 clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_MODE_WS_1_DATA</name>
                  <description>DSP mode WS 1 data</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RIGHTLOW</name>
              <description>Right Channel Low</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIGHT_HIGH</name>
                  <description>Right high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_LOW</name>
                  <description>Right low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEFTJUST</name>
              <description>Left-Justify Data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIGHT_JUSTIFIED</name>
                  <description>Right-justified</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFT_JUSTIFIED</name>
                  <description>Left-justified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONECHANNEL</name>
              <description>Single Channel Mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DUAL_CHANNEL</name>
                  <description>Dual channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_CHANNEL</name>
                  <description>Single channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDMDATA</name>
              <description>PDM Data Selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMIC_SUBSYSTEM</name>
                  <description>DMIC subsystem</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCK_POL</name>
              <description>SCK Polarity</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALLING_EDGE</name>
                  <description>Falling edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE</name>
                  <description>Rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WS_POL</name>
              <description>WS Polarity</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_INVERTED</name>
                  <description>Not inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>Inverted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATALEN</name>
              <description>Data Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_4</name>
                  <description>Data is 4 bits in length.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_5</name>
                  <description>Data is 5 bits in length.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_8</name>
                  <description>Data is 8 bits in length.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_31</name>
                  <description>Data is 31 bits in length.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_32</name>
                  <description>Data is 32 bits in length.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <description>Configuration Register 2 for the Primary Channel Pair</description>
          <addressOffset>0xC04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1FF01FF</resetMask>
          <fields>
            <field>
              <name>FRAMELEN</name>
              <description>Frame Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAME_LEN_4</name>
                  <description>Frame is 4 bits in total length</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_LEN_5</name>
                  <description>Frame is 5 bits in total length</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_LEN_512</name>
                  <description>Frame is 512 bits in total length</description>
                  <value>0x1FF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_LEN_2048</name>
                  <description>Frame is 2048 bits in total length</description>
                  <value>0x7FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POSITION</name>
              <description>Data Position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POSITION_0</name>
                  <description>Data begins at bit position 0 (the first bit position) within the frame or WS phase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSITION_1</name>
                  <description>Data begins at bit position 1 within the frame or WS phase</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSITION_2</name>
                  <description>Data begins at bit position 2 within the frame or WS phase</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status Register for the Primary Channel Pair</description>
          <addressOffset>0xC08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xD</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Busy Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLVFRMERR</name>
              <description>Slave Frame Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LR</name>
              <description>Left/Right Indication</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEFT_CHANNEL</name>
                  <description>Left channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_CHANNEL</name>
                  <description>Right channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAPAUSED</name>
              <description>Data Paused</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PAUSED</name>
                  <description>Not Paused</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAUSED</name>
                  <description>Paused</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV</name>
          <description>Clock Divider</description>
          <addressOffset>0xC1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>FCLK is used directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>FCLK is divided by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3</name>
                  <description>FCLK is divided by 3.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4096</name>
                  <description>FCLK is divided by 4,096.</description>
                  <value>0xFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
