nxp-mcuxpresso/mcux-soc-svd/LPC55S36/LPC55S36.xml
              <name>INT_EN30</name>
              <description>Interrupt A enable bits.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt A</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN31</name>
              <description>Interrupt A enable bits.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt A</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENB0</name>
          <description>Interrupt B enable control</description>
          <addressOffset>0x2580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INT_EN0</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN1</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN2</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN3</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN4</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN5</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN6</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN7</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN8</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN9</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN10</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN11</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN12</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN13</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN14</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN15</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN16</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN17</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN18</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN19</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN20</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN21</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN22</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN23</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN24</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN25</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN26</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN27</name>
              <description>Interrupt B enable bits.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_EN_0</name>
                  <description>Pin does not contribute to GPIO interrupt B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_1</name>
                  <description>Pin contributes to GPIO interrupt B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
